GopalSaraf/Practicals/PSDL/include/proc/pic16f17145.inc
// Register: PWM2CLK
#define PWM2CLK PWM2CLK
PWM2CLK                                  equ 050Dh
// bitfield definitions
PWM2CLK_CLK_POSN                         equ 0000h
PWM2CLK_CLK_POSITION                     equ 0000h
PWM2CLK_CLK_SIZE                         equ 0008h
PWM2CLK_CLK_LENGTH                       equ 0008h
PWM2CLK_CLK_MASK                         equ 00FFh
PWM2CLK_CLK0_POSN                        equ 0000h
PWM2CLK_CLK0_POSITION                    equ 0000h
PWM2CLK_CLK0_SIZE                        equ 0001h
PWM2CLK_CLK0_LENGTH                      equ 0001h
PWM2CLK_CLK0_MASK                        equ 0001h
PWM2CLK_CLK1_POSN                        equ 0001h
PWM2CLK_CLK1_POSITION                    equ 0001h
PWM2CLK_CLK1_SIZE                        equ 0001h
PWM2CLK_CLK1_LENGTH                      equ 0001h
PWM2CLK_CLK1_MASK                        equ 0002h
PWM2CLK_CLK2_POSN                        equ 0002h
PWM2CLK_CLK2_POSITION                    equ 0002h
PWM2CLK_CLK2_SIZE                        equ 0001h
PWM2CLK_CLK2_LENGTH                      equ 0001h
PWM2CLK_CLK2_MASK                        equ 0004h
PWM2CLK_CLK3_POSN                        equ 0003h
PWM2CLK_CLK3_POSITION                    equ 0003h
PWM2CLK_CLK3_SIZE                        equ 0001h
PWM2CLK_CLK3_LENGTH                      equ 0001h
PWM2CLK_CLK3_MASK                        equ 0008h

// Register: PWM2LDS
#define PWM2LDS PWM2LDS
PWM2LDS                                  equ 050Eh
// bitfield definitions
PWM2LDS_LDS_POSN                         equ 0000h
PWM2LDS_LDS_POSITION                     equ 0000h
PWM2LDS_LDS_SIZE                         equ 0008h
PWM2LDS_LDS_LENGTH                       equ 0008h
PWM2LDS_LDS_MASK                         equ 00FFh
PWM2LDS_LDS0_POSN                        equ 0000h
PWM2LDS_LDS0_POSITION                    equ 0000h
PWM2LDS_LDS0_SIZE                        equ 0001h
PWM2LDS_LDS0_LENGTH                      equ 0001h
PWM2LDS_LDS0_MASK                        equ 0001h
PWM2LDS_LDS1_POSN                        equ 0001h
PWM2LDS_LDS1_POSITION                    equ 0001h
PWM2LDS_LDS1_SIZE                        equ 0001h
PWM2LDS_LDS1_LENGTH                      equ 0001h
PWM2LDS_LDS1_MASK                        equ 0002h
PWM2LDS_LDS2_POSN                        equ 0002h
PWM2LDS_LDS2_POSITION                    equ 0002h
PWM2LDS_LDS2_SIZE                        equ 0001h
PWM2LDS_LDS2_LENGTH                      equ 0001h
PWM2LDS_LDS2_MASK                        equ 0004h

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
PWM2PRL                                  equ 050Fh
// bitfield definitions
PWM2PRL_PRL_POSN                         equ 0000h
PWM2PRL_PRL_POSITION                     equ 0000h
PWM2PRL_PRL_SIZE                         equ 0008h
PWM2PRL_PRL_LENGTH                       equ 0008h
PWM2PRL_PRL_MASK                         equ 00FFh

// Register: PWM2PRH
#define PWM2PRH PWM2PRH
PWM2PRH                                  equ 0510h
// bitfield definitions
PWM2PRH_PRH_POSN                         equ 0000h
PWM2PRH_PRH_POSITION                     equ 0000h
PWM2PRH_PRH_SIZE                         equ 0008h
PWM2PRH_PRH_LENGTH                       equ 0008h
PWM2PRH_PRH_MASK                         equ 00FFh

// Register: PWM2CPRE
#define PWM2CPRE PWM2CPRE
PWM2CPRE                                 equ 0511h
// bitfield definitions
PWM2CPRE_CPRE_POSN                       equ 0000h
PWM2CPRE_CPRE_POSITION                   equ 0000h
PWM2CPRE_CPRE_SIZE                       equ 0008h
PWM2CPRE_CPRE_LENGTH                     equ 0008h
PWM2CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM2PIPOS
#define PWM2PIPOS PWM2PIPOS
PWM2PIPOS                                equ 0512h
// bitfield definitions
PWM2PIPOS_PIPOS_POSN                     equ 0000h
PWM2PIPOS_PIPOS_POSITION                 equ 0000h
PWM2PIPOS_PIPOS_SIZE                     equ 0008h
PWM2PIPOS_PIPOS_LENGTH                   equ 0008h
PWM2PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM2GIR
#define PWM2GIR PWM2GIR
PWM2GIR                                  equ 0513h
// bitfield definitions
PWM2GIR_S1P1_POSN                        equ 0000h
PWM2GIR_S1P1_POSITION                    equ 0000h
PWM2GIR_S1P1_SIZE                        equ 0001h
PWM2GIR_S1P1_LENGTH                      equ 0001h
PWM2GIR_S1P1_MASK                        equ 0001h
PWM2GIR_S1P2_POSN                        equ 0001h
PWM2GIR_S1P2_POSITION                    equ 0001h
PWM2GIR_S1P2_SIZE                        equ 0001h
PWM2GIR_S1P2_LENGTH                      equ 0001h
PWM2GIR_S1P2_MASK                        equ 0002h
PWM2GIR_S1P1IF_POSN                      equ 0000h
PWM2GIR_S1P1IF_POSITION                  equ 0000h
PWM2GIR_S1P1IF_SIZE                      equ 0001h
PWM2GIR_S1P1IF_LENGTH                    equ 0001h
PWM2GIR_S1P1IF_MASK                      equ 0001h
PWM2GIR_S1P2IF_POSN                      equ 0001h
PWM2GIR_S1P2IF_POSITION                  equ 0001h
PWM2GIR_S1P2IF_SIZE                      equ 0001h
PWM2GIR_S1P2IF_LENGTH                    equ 0001h
PWM2GIR_S1P2IF_MASK                      equ 0002h

// Register: PWM2GIE
#define PWM2GIE PWM2GIE
PWM2GIE                                  equ 0514h
// bitfield definitions
PWM2GIE_S1P1_POSN                        equ 0000h
PWM2GIE_S1P1_POSITION                    equ 0000h
PWM2GIE_S1P1_SIZE                        equ 0001h
PWM2GIE_S1P1_LENGTH                      equ 0001h
PWM2GIE_S1P1_MASK                        equ 0001h
PWM2GIE_S1P2_POSN                        equ 0001h
PWM2GIE_S1P2_POSITION                    equ 0001h
PWM2GIE_S1P2_SIZE                        equ 0001h
PWM2GIE_S1P2_LENGTH                      equ 0001h
PWM2GIE_S1P2_MASK                        equ 0002h
PWM2GIE_S1P1IE_POSN                      equ 0000h
PWM2GIE_S1P1IE_POSITION                  equ 0000h
PWM2GIE_S1P1IE_SIZE                      equ 0001h
PWM2GIE_S1P1IE_LENGTH                    equ 0001h
PWM2GIE_S1P1IE_MASK                      equ 0001h
PWM2GIE_S1P2IE_POSN                      equ 0001h
PWM2GIE_S1P2IE_POSITION                  equ 0001h
PWM2GIE_S1P2IE_SIZE                      equ 0001h
PWM2GIE_S1P2IE_LENGTH                    equ 0001h
PWM2GIE_S1P2IE_MASK                      equ 0002h

